{"config": {"input_layers": [["input_encoder", 0, 0], ["input_decoder_teacher_forcing", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 384, 1], "name": "input_encoder"}, "class_name": "InputLayer", "name": "input_encoder"}, {"inbound_nodes": [[["input_encoder", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_1", "activity_regularizer": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D", "name": "conv_1"}, {"inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_norm_1", "momentum": 0.99, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_norm_1"}, {"inbound_nodes": [[["batch_norm_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation", "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "maxpool_1"}, "class_name": "MaxPooling2D", "name": "maxpool_1"}, {"inbound_nodes": [[["maxpool_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_2", "activity_regularizer": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D", "name": "conv_2"}, {"inbound_nodes": [[["conv_2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_norm_2", "momentum": 0.99, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_norm_2"}, {"inbound_nodes": [[["batch_norm_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation", "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "maxpool_2"}, "class_name": "MaxPooling2D", "name": "maxpool_2"}, {"inbound_nodes": [[["maxpool_2", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D", "name": "conv_3"}, {"inbound_nodes": [[["conv_3", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_norm_3", "momentum": 0.99, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_norm_3"}, {"inbound_nodes": [[["batch_norm_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation", "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "maxpool_3"}, "class_name": "MaxPooling2D", "name": "maxpool_3"}, {"inbound_nodes": [[["maxpool_3", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_4", "activity_regularizer": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D", "name": "conv_4"}, {"inbound_nodes": [[["conv_4", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_norm_4", "momentum": 0.99, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_norm_4"}, {"inbound_nodes": [[["batch_norm_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation", "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "maxpool_4"}, "class_name": "MaxPooling2D", "name": "maxpool_4"}, {"inbound_nodes": [[["maxpool_4", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_5", "activity_regularizer": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D", "name": "conv_5"}, {"inbound_nodes": [[["conv_5", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_norm_5", "momentum": 0.99, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_norm_5"}, {"inbound_nodes": [[["batch_norm_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation", "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "maxpool_5"}, "class_name": "MaxPooling2D", "name": "maxpool_5"}, {"inbound_nodes": [[["maxpool_5", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_6", "activity_regularizer": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D", "name": "conv_6"}, {"inbound_nodes": [[["conv_6", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_norm_6", "momentum": 0.99, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "class_name": "BatchNormalization", "name": "batch_norm_6"}, {"inbound_nodes": [[["batch_norm_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation", "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "maxpool_6"}, "class_name": "MaxPooling2D", "name": "maxpool_6"}, {"inbound_nodes": [[["maxpool_6", 0, 0, {}]]], "config": {"name": "reshape", "target_shape": [-1, 512], "trainable": true}, "class_name": "Reshape", "name": "reshape"}, {"inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 55, 100], "name": "input_decoder_teacher_forcing"}, "class_name": "InputLayer", "name": "input_decoder_teacher_forcing"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"kernel_regularizer": null, "units": 512, "dropout": 0.0, "return_sequences": false, "unroll": false, "name": "lstm_encoder", "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "go_backwards": false, "bias_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": true, "trainable": true, "recurrent_regularizer": null, "implementation": 1}, "class_name": "LSTM", "name": "lstm_encoder"}, {"inbound_nodes": [[["input_decoder_teacher_forcing", 0, 0, {}], ["lstm_encoder", 0, 1, {}], ["lstm_encoder", 0, 2, {}]]], "config": {"kernel_regularizer": null, "units": 512, "dropout": 0.0, "return_sequences": true, "unroll": false, "name": "lstm_decoder", "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "go_backwards": false, "bias_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": true, "trainable": true, "recurrent_regularizer": null, "implementation": 1}, "class_name": "LSTM", "name": "lstm_decoder"}, {"inbound_nodes": [[["lstm_decoder", 0, 0, {}]]], "config": {"units": 100, "kernel_regularizer": null, "bias_constraint": null, "name": "dense", "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense", "name": "dense"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"activation": "softmax", "trainable": true, "name": "softmax"}, "class_name": "Activation", "name": "softmax"}], "output_layers": [["softmax", 0, 0]], "name": "model_1"}, "class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow"}